Repository: pikougi-nabot/epochrefs-old
Catalog: commit/84000/data-translation-memory/toh44-45_84000-the-stem-array.tmx/chapters-54-56.tmx
Source language: bo
Languages: en

source: ན་བའི་གསོས་སྨན་དང་། ལ་ལ་ལས་ནི་ཕ་མ་ལ་ཕུ་དུད་བྱེད་པ་དང་། ལ་ལ་ལས་ནི་དགེ་བའི་བཤེས་གཉེན་ལ་རིམ་གྲོ་བྱེད་པ་དང་། ལ་ལ་ལས་ནི་ཉན་ཐོས་ཀྱི་ཁ་དོག་དང་། གཟུགས་ཀྱིས་སེམས་ཅན་འདུལ་བ་ལ་བརྩོན་པ་དང་། ལ་ལ་ལས་ནི་རང་སངས་རྒྱས་ཀྱི་ཁ་དོག་དང་། གཟུགས་ཀྱིས་སེམས་ཅན་འདུལ་བ་ལ་བརྩོན་པ་དང་། ལ་ལ་ལས་ནི་བྱང་ཆུབ་སེམས་དཔའི་ཁ་དོག་དང་། གཟུགས་ཀྱིས་སེམས་ཅན་འདུལ་བ་ལ་བརྩོན་པ་དང་། ལ་ལ་ལས་ནི་སངས་རྒྱས་ཀྱི་སྐུ་མདོག་དང་སྐུ་གཟུགས་ཀྱིས་སེམས་ཅན་འདུལ་བ་ལ་བརྩོན་པ་དང་། ལ་ལ་ལས་ནི་སྐྱེས་པའི་རབས་ཀྱི་ཁྱད་པར་ཐམས་ཅད་ཀྱིས་སྐྱེ་བ་ཡོངས་སུ་བསྟན་ཏེ།
en: in some, he was dedicated to guiding beings in the appearance and form of a śrāvaka; in some, he was dedicated to guiding beings in the appearance and form of a pratyeka­buddha; in some, he was dedicated to guiding beings in the appearance and form of a bodhisattva; in some, he was dedicated to guiding beings in the appearance and form of a buddha; in some, he ripened beings through manifesting being reborn in any of the particular births of beings;

source: སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་དང་། ལ་ལ་ལས་ནི་ཆོས་སྨྲ་བའི་གཟུགས་ཀྱིས་དེ་བཞིན་གཤེག་པའི་བསྟན་པ་ལ་ཞུགས་ཏེ། ལུང་དབོག་པ་དང་། ཁ་ཏོན་བྱ་བ་དང་ཚུལ་བཞིན་དུ་དཔྱད་པར་བྱ་བ་ལ་བརྩོན་པ་དང་། དེ་བཞིན་གཤེགས་པའི་མཆོད་རྟེན་ལ་རྒྱན་གྱིས་བརྒྱན་པར་བྱེད་པ་དང་། དེ་བཞིན་གཤེགས་པའི་སྐུ་གཟུགས་བྱེད་དུ་འཇུག་པ་དང་། སངས་རྒྱས་མཆོད་པ་ལ་སེམས་ཅན་ཡོངས་སུ་བསྐུལ་བ་དང་། སྤོས་དང་བྱུག་པ་གསོལ་ཞིང་། འབྲུ་མར་དྲི་ཞིམ་པོས་བྱུག་པ་དང་། དྲིལ་བུ་དང་། མེ་ཏོག་གི་ཕྲེང་བ་གསོལ་བ་ལ་སྩོགས་པ།
en: in some, in the form of a dharmabhāṇaka, he entered the teachings of a tathāgata, received the transmission of the teachings, recited the teachings, correctly analyzed them, adorned the caitya of the Tathāgata, had statues of the Tathāgata made, inspired beings to make offerings to the Tathāgata, anointed them with perfumes and ointments, dressed them in bells and garlands, and so on, and he was dedicated to making offerings to the Buddha and established beings on the path of the ten good actions, established beings in the five precepts, the eight poṣadha vows, taking refuge in the Buddha, Dharma, and Saṅgha, entering mendicancy, hearing the Dharma, receiving the transmission of the Dharma, reciting the Dharma, and contemplating it correctly;

source: སངས་རྒྱས་ཀྱི་མཆོད་པ་རྣམ་པ་ཐམས་ཅད་ལ་བརྩོན་པ་དང་། དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ལ་སེམས་ཅན་རབ་ཏུ་འགོད་པ་དང་། བསླབ་པའི་གནས་ལྔ་དང་། གསོ་སྦྱིན་གྱི་ཡན་ལག་བརྒྱད་དང་། སངས་རྒྱས་དང་། ཆོས་དང་། དགེ་འདུན་ལ་སྐྱབས་བཙལ་བ་དང་། རབ་ཏུ་འབྱུང་བ་དང་། ཆོས་མཉན་པ་དང་། ལུང་མནོད་པ་དང་། ཁ་ཏོན་བྱ་བ་དང་། ཚུལ་བཞིན་ཡིད་ལ་བྱ་བ་ལ་སེམས་ཅན་དགོད་པར་བྱེད་པ་དང་། ཆོས་ཀྱི་གཏམ་བྱ་བའི་ཕྱིར་སེང་གེའི་སྟན་ལ་འདུག་ཅིང་སངས་རྒྱས་ཀྱི་བྱང་ཆུབ་རྣམ་པར་འགྲེལ་བ་དང་། དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་བྱམས་པས་བསྐལ་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་གྲངས་མེད་པར་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ལ་སྤྱད་པ་དེ་དག་ཐམས་ཅད་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་མྱིག་མངས་རིས་དེ་དག་ལས་རྣམ་པ་གཞན་དང་གཞན་དུ་མཐོང་བར་གྱུར་ཏོ།
en: and in order to talk about the Dharma he sat upon a lion throne and explained the enlightenment of the buddhas. In that way, the bodhisattva Maitreya practiced the six perfections for countless hundreds of thousands of quintillions of kalpas. Sudhana, the head merchant’s son, saw all of that in various ways within each square of the checkerboard patterns.

source: དེས་ཁང་པ་བརྩེགས་པ། ལ་ལར་ནི་བྱང་ཆུབ་སེམས་དཔའ་བྱམས་པས་དགེ་བའི་བཤེས་གཉེན་ཇི་སྙེད་ཅིག་བསྙེན་བཀུར་བ་དེ་དག་ཐམས་ཅད་ཀྱི་རྣམ་པར་འཕྲུལ་པའི་རྒྱན་ཐམས་ཅད་ཀྱང་མཐོང་བར་གྱུར་ཏེ།
en: He saw in some kūṭāgāras the bodhisattva Maitreya serving as many kalyāṇamitras as there are, and all the array of miraculous manifestations that came from that.

source: དགེ་བའི་བཤེས་གཉེན་དེ་དག་ཐམས་ཅད་ཀྱི་དྲུང་དུ་བདག་ཉིད་ཕྱིན་ཅིང་།
en: Sudhana went before all those kalyāṇamitras, and he perceived them speaking to him and giving an instruction: “Come here, Sudhana!

source: ཚུར་ཤོག་ནོར་བཟངས་ལེགས་པར་འོངས་སམ།
en: Welcome! Are you well?

source: མི་ངལ་ལམ། འདེ་རེ་བྱང་ཆུབ་སེམས་དཔའི་རྒྱན་དང་ཡུལ་རྣམ་པར་སྤྲུལ་བ་བསམ་གྱིས་མི་ཁྱབ་པ་འདི་དག་ལ་ལྟོས་ཤིག །ཅེས་བསྒོ་ཞིང་གཏམ་ཤེས་པར་བྱེད་པར་གྱུར་ཏེ།
en: Look at this inconceivable range and display of miraculous manifestations of the bodhisattva!”

source: དེ་ལྟར་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་ཁང་པ་བརྩེགས་པ། དེ་དག་རེ་རེ་དང་། དམིགས་པ་དེ་དག་རེ་རེ་ལས་ཀྱང་། བསམ་གྱིས་མི་ཁྱབ་པའི་རྒྱན་དང་། ཡུལ་རྣམ་པར་སྤྲུལ་པ་འདི་དག་དང་། གཞན་དག་ཀྱང་གྲངས་མེད་པ་མང་པོ་མཐོང་བར་གྱུར་ཏེ།
en: Sudhana, the head merchant’s son, saw in each of the kūṭāgāras, and in each object of perception, this and other ranges and displays of miraculous manifestations.

source: དྲན་པའི་མཐུ་ཉམས་པ་མེད་པ་དང་། མིག་ཡོངས་སུ་དག་པ། ཕྱོགས་ཀུན་ཏུ་རྣམ་པར་ལྟ་བ་དང་། ལྷག་མཐོང་ལ་ལྟ་བའི་ཡེ་ཤེས་སྒྲིབ་པ་མེད་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ཡེ་ཤེས་དང་། བྱིན་གྱི་རླབས་ཀྱི་དབང་རབ་ཏུ་ཐོབ་པས། བྱང་ཆུབ་སེམས་དཔའི་འདུ་ཤེས་ཀྱི་རྣམ་པ་ལ་ཞུགས་པའི་ཡེ་ཤེས་ཀྱི་ས་ལ་གནས་ཏེ། མཐའ་ཡས་པའི་རྒྱན་དང་། ཡུལ་རྣམ་པར་སྤྲུལ་པ་དེ་དག་ཐམས་ཅད་མཐོང་བར་གྱུར་ཏོ། །འདི་ལྟ་སྟེ།
en: Because of his unfailing power of memory, his pure vision, his view of all directions, and his unobscured wisdom of view in vipaśyanā, he was established on the level of wisdom that comes from the understanding of a bodhisattva, and therefore he saw all that infinite range and display of miraculous manifestations.

source: དཔེར་ན། སྐྱེས་བུ་གཉིད་ཀྱིས་ལོག་པའི་རྨི་ལམ་དུ། གཟུགས་ཀྱི་དམིགས་པའི་ཁྱད་པར་སྣ་ཚོགས་མང་པོ་ཞིག་མཐོང་བར་གྱུར་ཏེ། འདི་ལྟར་ཁྱིམ་དང་གཞལ་མེད་ཁང་མདངས་དགའ་བའམ།
en: It was like when a person goes to sleep and in a dream sees many various particular perceived forms, such as delightful houses and divine palaces;

source: གྲོང་དང་། གྲོང་ཁྱེར་དང་། ལྗོངས་དང་། ཡུལ་མདངས་དགའ་བའམ།
en: delightful villages, towns, districts, and regions;

source: བཟའ་ཤིང་གི་ར་བ་དང་། ཀུན་དགའི་ར་བ་དང་། དཀའ་ཐུབ་ཀྱི་ནགས་ཚལ་མདངས་དགའ་བའམ།
en: delightful parks, gardens, and forest groves;

source: ཤིང་དང་། ཆུ་ཀླུང་དང་། རྫིང་དང་། རི་མདངས་དགའ་བ་འམ།
en: delightful trees, rivers, pools, and mountains;

source: གོས་དང་། ཁ་ཟས་དང་། བཏུང་བའི་ལོངས་སྤྱོད་ཉམས་སུ་བདེ་བའམ།
en: delightful clothes, food, drink, and enjoyments;

source: གླུ་དང་། སིལ་སྙན་དང་། རོལ་མོའི་སྒྲ་སྙན་པ་སྣ་ཚོགས་ཀྱིས་རྩ་བ་ཉམས་སུ་དགའ་བ་ཞིག་མཐོང་ངམ།
en: and the enjoyment of the pleasures of delightful songs, instrumental music, and percussive music.

source: ཕ་མ་དང་གཉེན་བཤེས་དང་། བདག་ཉིད་འགྲོགས་པར་ཤེས་པར་གྱུར་པའམ།
en: He perceives himself in the company of his father, mother, friends, family, and relatives.

source: རྒྱ་མཚོ་ཆེན་པོ་དང་། རིའི་རྒྱལ་པོ་རི་རབ་དང་། ལྷའི་གནས་ཐམས་ཅད་དང་། འཛམ་བུའི་གླིང་དག་ན་བདག་དཔག་ཚད་བརྒྱ་ཕྲག་དུ་མར་གནས་པར་ཤེས་པར་གྱུར་ལ།
en: He sees the great ocean. He perceives Sumeru , the king of mountains, all divine realms, and Jambudvīpas, in which he himself is many hundreds of yojanas tall.

source: ཁྱིམ་འམ་གནས་དེ་ཡང་ཤིན་ཏུ་ཡངས་ཤིང་།
en: He sees his house and environs as vast.

source: ཡོན་ཏན་དང་རྒྱན་ཐམས་ཅད་ཀྱིས་ཡོངས་སུ་བརྒྱན་པར་མཐོང་སྟེ།
en: He perceives them to be adorned with all qualities and adornments.

source: ཉིན་པར་ཞིག་ཡིན་པར་ཤེས་ཀྱང་། ནམ་དེ་ཡང་རིང་བ་དང་། ཐུང་བར་བྱེ་བྲག་མི་འབྱེད་ལ་རྨི་ལམ་ཡིན་པ་ཙམ་དུའང་མི་ཤེས་སོ།
en: Even though he knows it is daytime, he cannot tell if that day is long or short, or even know that this is a dream.

source: །བདག་ཉིད་ཀྱང་བདེ་བའི་ཡོ་བྱད་ཐམས་ཅད་དང་ལྡན་ཞིང་ལུས་ཀྱི་འདུ་བྱེད་ཟོ་བདོག་བདེ་ལ་སྙོམས་པ་དང་། གཉིད་མེད་དེ་མི་དགའ་བ་ཐམས་ཅད་ཡོངས་སུ་བསྩལ་བས། དགའ་བ་དང་། བདེ་བ་རྒྱ་ཆེན་པོ་ཉམས་སུ་མྱོང་སྟེ།
en: He perceives having all things that are pleasant, and he has the appearance of his composite body being in a state of happiness, not sleeping and free of all that is unpleasant, experiencing vast joy and happiness.

source: ཡུན་ཀྱང་རིང་མོ་ཞིག་ལོན་པ་སྙམ་ནས། ཉིན་གཅིག་གམ། ཉིན་བདུན་ནམ། ཟླ་བ་ཕྱེད་དམ།
en: He thinks this lasts a long time:

source: ཟླ་བ་གཅིག་གམ། ལོ་གཅིག་གམ། ལོ་བརྒྱའམ། དེ་བས་ཀྱང་རིང་བ་ཞིག་ལོན་པ་ཙམ་དུ་ཤེས་པར་གྱུར་ནས། ས་ངན་དེ་ཐམས་ཅད་ཀྱང་རྗེས་སུ་དྲན་ནོ།
en: for a day, a week, a fortnight, a month, a year, a hundred years, or longer, and when he wakes he remembers it all.

source: །དེ་བཞིན་དུ་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་ཀྱང་། བྱང་ཆུབ་སེམས་དཔའ་བྱིན་གྱི་རླབས་དང་། ཁམས་གསུམ་ཐམས་ཅད་རྨི་ལམ་ལྟ་བུར་ཡང་དག་པར་གཞོལ་བའི་ཡེ་ཤེས་ཀྱིས་ཆུང་བའི་འདུ་ཤེས་འགགས་པའི་སེམས་དང་ལྡན་པར་གྱུར་ཏེ། བྱང་ཆུབ་སེམས་དཔའི་འདུ་ཤེས་ཀྱི་རྣམ་པ་ཡངས་ཤིང་། རྒྱ་ཆེ་བ་དང་། སྒྲིབ་པ་མེད་པ་ལ་གནས་ཤིང་། བྱང་ཆུབ་སེམས་དཔའི་རྒྱན་གྱི་ཡུལ་ཁོང་དུ་ཆུད་ལ། བྱང་ཆུབ་སེམས་དཔའི་ཚུལ་ལ་འཇུག་པ་བསམ་གྱིས་མི་ཁྱབ་པའི་རྗེས་སུ་འབྲང་བའི་བློ་དང་ལྡན་པས། རྒྱན་རྣམ་པར་སྤྲུལ་པ་དེ་དག་ཐམས་ཅད་ཀྱང་མཐོང་བར་གྱུར་ཏོ། །ཤེས་པར་གྱུར་ཏོ། །ཉམས་སུ་མྱོང་པར་གྱུར་ཏོ། །རྣམ་པར་དཔྱད་པར་གྱུར་ཏོ། །མཚན་མར་བྱས་པར་གྱུར་ཏོ། །དམིགས་ཀྱིས་རྟོགས་པར་གྱུར་ཏོ།
en: In that way, Sudhana, the head merchant’s son, through the blessing of the bodhisattva Maitreya, and through a knowledge that was free from a limited perception, like that of someone who has entered a dream of the three realms, was dwelling in the vast, extensive, unobscured perception of a bodhisattva and possessed the comprehension that could follow the inconceivable entry into the way of the bodhisattva and comprehend the scope of the displays of a bodhisattva, and therefore he saw all of those displays of miraculous manifestations, knew them, experienced them, examined them, identified them, and beheld them.

source: །བདག་ཉིད་ཀྱང་། དེ་དག་ན་འདུག་པར་ཤེས་པར་གྱུར་ཏོ།
en: He also perceived himself to be present among them.

source: །འདི་ལྟ་སྟེ། དཔེར་ན། མི་ནད་པ་སེམས་ཀྱི་རྒྱུད་ཐ་མ་བྱུང་བར་གྱུར་ཏེ།
en: This is like when a sick person is in the final phase of his mind.

source: དེ་མ་ཐག་ཏུ་སྐྱེ་བའི་སེམས་ཉེ་བར་གནས་ནས། ལས་ཀྱི་སྲིད་པ་མངོན་དུ་གྱུར་ན།
en: In the instant that occurs, his existing karma manifests:

source: ལས་ཇི་ལྟ་བུར་བྱས་ཤིང་བསགས་པའི་རྣམ་པར་སྨིན་པས། ལས་མི་དགེ་བའི་རྐྱེན་གྱིས་ནི། སེམས་ཅན་དམྱལ་བ་དང་། བྱོལ་སོང་གི་སྐྱེ་གནས་དང་། ཡི་དགས་ཀྱི་ཡུལ་ལམ། གཤིན་རྗེའི་མྱི་ལག་ཆ་གཉེམྶ་བ་ཐོགས་པ། གཤེ་ཞིང་ཁྲོ་བ་དག་ཀྱང་མཐོང་བར་འགྱུར།
en: there is the ripening of whatever kind of karma he has accumulated, so that on the basis of bad karma he sees the hells, birth as an animal, the realm of the pretas, or the servants of Yama holding menacing weapons and furiously shouting abuse;

source: སེམས་ཅན་དམྱལ་བའི་ངུད་མོ་དང་། འོ་དོད་ཀྱི་སྒྲ་ཡང་ཐོས་པར་གྱུར་ལ།
en: he hears the sounds of the wailing and cries of the beings in the hells;

source: བ་ཚྭའི་ཆུ་དེ་དག་ཀྱང་མཐོང་སྟེ།
en: he sees the rivers of acid;

source: སྤུ་གྲིའི་སོ་བཤིབས་པའི་རི་དེ་དག་དང་། ལྕགས་ཀྱི་ཤལ་མ་ལིའི་སྡོང་པོ་དེ་དག་དང་། རལ་གྱིའི་སོའི་ནགས་ཚལ་དེ་དག་ཀྱང་། མཐོང་བར་གྱུར་ཏམ།
en: he sees the mountains of rows of razor-blade edges, the iron cotton trees, and the forests of sword blades;

source: སེམས་ཅན་དམྱལ་བ་དེ་དག་ཀྱང་། ཀུན་ནས་འབར་ཞིང་ཡོངས་སུ་འབར་བ་དང་། རབ་ཏུ་འབར་བ་དང་། ལྕགས་ཀྱི་བུམ་པ་གཅིག་ཏུ་འབར་བ་དེ་དག་ཀྱང་། མཐོང་བར་གྱུར་ལ། གནོད་པ་དེ་དག་ཐམས་ཅད་ཀྱིས་ཀྱང་གནོད་པར་བྱ་ཞིང་།
en: and he sees the beings in hell on fire, burning, being incinerated, and all burning inside one iron pot.

source: ཚོར་བ་དེ་དག་ཀྱང་ཉམས་སུ་མྱོང་བ་ཙམ་དུ་ཤེས་པར་གྱུར་ཏེ། སེམས་ཅན་དམྱལ་བ་པ་དེ་དག་ཀྱང་། མེའི་གདུང་བས། སྡུག་བསྔལ་བ་ཞིག་ཏུ་མཐོང་ངམ། བདག་གིས་མྱོང་བར་གྱུར་ཏམ།
en: He perceives those harms being inflicted and those sensations being experienced, and he sees and feels the suffering of the hell beings being burned by fire.

source: ལས་དགེ་བའི་ཚོགས་ཀྱིས་ལྷའི་ཁང་པ་དང་། གནས་ཤིག་མཐོང་བར་གྱུར་ཏམ།
en: Through good karma he sees the palaces and dwellings of devas:

source: ལྷའི་འཁོར་དང་། ལྷ་མོའི་ཚོགས་དང་། རྒྱན་རྣམ་པར་ཕྱེ་བ་ཐམས་ཅད་ཀྱང་མཐོང་བར་གྱུར་ཏེ།
en: he sees the retinue of a deva, the groups of apsarases, and all the arrayed adornments;

source: བཟའ་ཤིང་གི་ར་བ་དང་། དཀའ་ཐུབ་ཀྱི་ནགས་ཚལ་དང་། ཆུ་ཀླུང་དང་། རྫིང་དང་། རིན་པོ་ཆེའི་རི་དང་། ཡིད་བཞིན་གྱི་ཤིང་དང་། ལོངས་སྤྱོད་མང་པོ་མཐོང་ངོ་། །ཉམས་སུ་མྱོང་པར་གྱུར་ཏེ། ཚེའི་ཡུན་ཀྱང་དེ་དང་མཉམ་པར་ཤེས་པར་གྱུར་ན།
en: he sees and experiences parks, forest groves, rivers, ponds, precious mountains, wish-fulfilling trees, and many enjoyments, and he perceives them to last for a lifetime.

source: དེ་ནི་འདི་ནས་ཀྱང་འཕོས་པ་མེད། དེར་ཡང་སྐྱེས་པ་མེད་དེ། མི་སྣང་བར་མ་གྱུར་བཞིན་དུ། ལས་ཀྱི་ཡུལ་བསམ་གྱིས་མྱི་ཁྱབ་པས་བྱ་བའི་རྣམ་པ་དེ་ལྟ་བུ་དག་ཤེས་ཤིང་མཐོང་ལ་ཉམས་སུ་མྱོང་བར་རུང་ངོ་།
en: Even though he has not passed away from this world and has not been reborn elsewhere, because of the inconceivable scope of karma, those kinds of appearances are not imperceptible but are perceived and experienced.

source: །དེ་བཞིན་དུ་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའི་ལས་ཀྱི་ཡུལ་བསམ་གྱིས་མི་ཁྱབ་པའི་ཕྱིར། རྒྱན་རྣམ་པར་སྤྲུལ་པ་དེ་དག་ཐམས་ཅད་ཀྱང་མཐོང་བར་གྱུར་ཏོ།
en: In the same way, Sudhana, the head merchant’s son, because of the inconceivable scope of a bodhisattva’s karma, saw all that display of miraculous manifestations.

source: །འདི་ལྟ་སྟེ། དཔེར་ན། སྐྱེས་བུ་འབྱུང་པོའི་གདོན་གྱིས་ནོན་པས་ནི་གཟུགས་ཀྱི་རྣམ་པ་སྣ་ཚོགས་མང་པོ་མཐོང་སྟེ། ཅི་དྲིས་པ་དེ་དག་གི་ལུང་ཡང་སྟོན་ཏོ།
en: By analogy, when a person is overpowered by a demon spirit, they will see many various kinds of forms, and whatever questions they ask, it will reveal an answer to them.

source: །དེ་བཞིན་དུ་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའི་ཡེ་ཤེས་དང་བྱིན་གྱིས་རླབས་ཀྱི་མཐུས་རྒྱན་དེ་དག་ཐམས་ཅད་མཐོང་བར་གྱུར་ཏོ། །འདི་ལྟ་སྟེ་དཔེར་ན། ཀླུའི་ཁང་པར་ཕྱིན་པའི་སྐྱེས་བུ་ནི། ཀླུའི་འདུ་ཤེས་ཀྱི་རྣམ་པ་ལ་ཞུགས་པས། ཉི་མ་གཅིག་གམ། ཉི་མ་བདུན་ནམ། ཟླ་བ་ཕྱེད་དམ།
en: In the same way, Sudhana, the head merchant’s son, saw all those arrays through the power of the blessing of the bodhisattva.

source: ཟླ་བ་གཅིག་གམ། ལོ་གཅིག་གམ། ལོ་བརྒྱར་ཡང་འདུ་ཤེས་ཀྱི་རྣམ་པར་ཤེས་ཏེ། ཀླུའི་འདུ་ཤེས་ཀྱི་རྣམ་པ་དང་། བྲལ་ནས། མིའི་འདུ་ཤེས་ཀྱི་རྣམ་པར་ན་ཡིད་ཙམ་ལས་མ་ལོན་པར་མཐོང་ངོ་།
en: By analogy, a person who goes into the dwelling of a nāga will enter into a nāga’s perception and will have the perception of a day, a week, a fortnight, a month, a year, or a hundred years passing, but when they separate from the nāga’s perception, they will see that in terms of human perception only a moment has passed.

source: །དེ་བཞིན་དུ་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་བྱང་ཆུབ་སེམས་དཔའི་འདུ་ཤེས་ཀྱི་རྣམ་པ་མ་བཏང་བའི་བློ་དང་ལྡན་པས་ཀྱང་། བྱང་ཆུབ་སེམས་དཔའ་བྱམས་པའི་བྱིན་གྱི་རླབས་ཀྱིས། ཡུད་ཙམ་གཅིག་པོ་དེ་ཡང་བསྐལ་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་མང་པོར་ཤེས་པར་གྱུར་ཏོ། །འདི་ལྟ་སྟེ།
en: In the same way, Sudhana, the head merchant’s son, having a mind that maintained the perception of a bodhisattva and the blessing of the bodhisattva Maitreya, perceived in one moment many hundreds of thousands of quintillions of kalpas.

source: དཔེར་ན། ཚངས་པ་ཆེན་པོའི་གཞལ་མེད་ཁང་འགྲོ་བ་ཐམས་ཅད་ན་རྒྱན་གྱི་དམ་པ་ཕུལ་ཞེས་བྱ་བ་ཡོད་དེ། དེའི་ནང་དུ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་ཀྱང་། གཟུགས་བརྙན་གྱི་ཚུལ་དུ་དམིགས་པ་ཐམས་ཅད་དང་མ་འདྲེས་པར་གསལ་བར་སྣང་ངོ་།
en: By analogy, within Mahābrahmā’s divine palace, called Sarva­jagadvara­vyūha­garbha, the perceived reflections of all the world realms in the billion-world universe appear clearly and distinctly.

source: །དེ་བཞིན་དུ་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་ཀྱང་། རྒྱན་དེ་དག་ཐམས་ཅད་དམིགས་པ་ཐམས་ཅད་དུ། ཕན་ཚུན་མ་འདྲེས་པ་དང་། ཕན་ཚུན་མ་འཛིངས་པར་གཟུགས་བརྙན་རབ་ཏུ་བྱུང་བ་མཐོང་ངོ་། །འདི་ལྟ་སྟེ། དཔེར་ན། རྒྱས་པའི་སྐྱེ་མཆེད་ཀྱི་སྙོམས་པར་འཇུག་པ་ལ་རྣམ་པར་སྤྱོད་པའི་དགེ་སློང་ནི། གཅིག་པུ་གཉིས་སུ་མེད་པར་ཁང་བུའམ། འཆག་ས་འམ།
en: In the same way, Sudhana, the head merchant’s son, saw the arising of all those displays, all those perceptions, unmixed with one another and unmingled with one another.

source: འདུག་པའི་གནས་ན་འདུག་གམ། འགྲེང་ཡང་རུང་སྟེ། འཇིག་རྟེན་ཐམས་ཅད་རྒྱས་པའི་སྐྱེ་མཆེད་གང་ལ་སྙོམས་པར་ཞུགས་པའི། ཡུལ་བཞིན་དུ་བསམ་གཏན་པའི་ཡུལ། བསམ་གྱིས་མི་ཁྱབ་པར་མཐོང་ཞིང་།
en: By analogy, a monk dwelling in the samāpatti of a meditative state of totality in a singleness without duality, whether in his cell or on a walkway, seated on a seat or standing up, perceives, sees, and experiences the entire world as the inconceivable scope of his meditation, the scope of his samāpatti of whichever meditative state of totality.

source: ཉམས་སུ་མྱོང་ངོ་། །དེ་བཞིན་དུ་ཚོང་དཔོན་གྱི་བུ། ནོར་བཟངས་ཀྱིས་ཀྱང་ཡུལ་གང་ལ་ཞུགས་པའི་ཚུལ་བཞིན་དུ་རྒྱན་དེ་དག་ཐམས་ཅད་མཐོང་ཞིང་ཤེས་ཏེ། ཉམས་སུ་མྱོང་བར་གྱུར་ཏོ།
en: In the same way, Sudhana, the head merchant’s son, saw and experienced those displays according to whatever scope of perception he engaged in.

source: །འདི་ལྟ་སྟེ་དཔེར་ན། དྲི་ཟའི་གྲོང་ཁྱེར་རྣམས་ཀྱི་རྒྱན་དང་ལྷབ་ལྷུབ་ཐམས་ཅད་ནམ་མཁའི་དབྱིངས་ལ་བྱུང་བ་ནི་ཡོངས་སུ་སྣང་ཡང་ཅི་ལ་ཡང་སྒྲིབ་པར་མི་འགྱུར་རོ། །འདི་ལྟ་སྟེ་དཔེར་ན།
en: It was like the display and ornamentation of a gandharva city that appears in the sky, which occurs without any obscuration.

source: གནོད་སྦྱིན་གྱི་གཞལ་མེད་ཁང་མིའི་ཁང་པ་ན་འདུག་པའམ།
en: It was like the palace of a yakṣa being within a human palace, or a human palace being within a yakṣa palace;

source: མིའི་ཁང་པ་གནོད་སྦྱིན་གྱི་ཁང་པའི་ཁོངས་ན་འདུག་པ་ནི་ཕན་ཚུན་ཐ་མི་དད་དེ་ལས་ཀྱི་ཡུལ་རྣམ་པ་ཇི་ལྟར་དག་པའི་ཚུལ་བཞིན་དུ་སྣང་ངོ་།
en: they are inseparable but are perceived in accordance with the purity of the scope of perception of a person’s karma.

source: །འདི་ལྟ་སྟེ་དཔེར་ན། རྒྱ་མཚོ་ཆེན་པོ་ལ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་ཀྱང་རྒྱའི་གཟུགས་བརྙན་ལྟར་སྣང་ངོ་།
en: It was like all the world realms of a billion-world universe appearing upon a great ocean as reflections on the ocean.

source: །འདི་ལྟ་སྟེ་དཔེར་ན། སྒྱུ་མའི་མཁན་པོ་ནི་སྔགས་དང་རིག་སྔགས་དང་། རྩིའི་མཐུ་དང་བྱིན་གྱི་རླབས་ཀྱིས་གཟུགས་ཀྱི་རྣམ་པ་ཐམས་ཅད་དང་བྱ་བ་ཐམས་ཅད་ཀྱང་ཡོངས་སུ་སྟོན་ཏོ།
en: By analogy, a conjurer manifests all kinds of forms and activities through the blessings of the power of mantras, spells, and potions.

source: །དེ་བཞིན་དུ་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་བྱམས་པའི་བྱིན་གྱི་རླབས་དང་། ཡེ་ཤེས་སྒྱུ་མ་བསམ་གྱིས་མི་ཁྱབ་པ་ལ་ཞུགས་པས་བྱང་ཆུབ་སེམས་དཔའི་དབང་དང་བྱིན་གྱི་རླབས་ཀྱི་ཡེ་ཤེས་ཆོས་ཐམས་ཅད་ཤེས་པ་སྒྱུ་མའི་སྟོབས་ཀྱི་མངོན་པར་བསྒྲུབས་པའི་མཐུས་རྒྱན་གྱི་ཡུལ་རྣམ་པར་སྤྲུལ་པ་དེ་དག་ཐམས་ཅད་མཐོང་བར་གྱུར་ཏོ།
en: In the same way, Sudhana, the head merchant’s son, saw all the displays of miraculous manifestations because of the bodhisattva Maitreya’s engagement in inconceivable conjurations from blessing and wisdom. This was because of his accomplishment of the power of conjuration from the knowledge of all phenomena and because of conjuration through a bodhisattva’s power of blessing and wisdom.

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་བྱམས་པས་ཁང་པ་བརྩེགས་པ་དེའི་ནང་དུ་སོང་སྟེ། བྱིན་གྱི་རླབས་དེ་དག་བརྟུལ་ནས། ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ལ་སེ་གོལ་གྱི་སྒྲ་བྱས་ཏེ། འདི་སྐད་ཅེས་སྨྲས་སོ། །རིགས་ཀྱི་བུ་འདི་ནི་ཆོས་རྣམས་ཀྱི་ཆོས་ཉིད་ཡིན་གྱི་ལོངས་རིགས་ཀྱི་བུ་ཆོས་ཐམས་ཅད་ནི་རྣམ་པར་བསྒྲུབ་ན་ཉེ་བར་འགྲུབ་པའི་མཚན་ཉིད་དེ།
en: Then the bodhisattva Maitreya entered the kūṭāgāra and, diminishing those blessings, he snapped his fingers, saying to Sudhana, the head merchant’s son, “Arise, noble one! Noble one, this is the nature of phenomena.

source: བྱང་ཆུབ་སེམས་དཔའི་ཡེ་ཤེས་ཀྱི་བྱིན་གྱིས་བརླབས་པའོ།
en: This is the blessing of the wisdom of a bodhisattva. It is the characteristic of accomplishment from the practice of all Dharmas.

source: །རང་བཞིན་དེ་ལྟ་བུ་སྟེ་ཡོངས་སུ་མ་གྲུབ་པའོ།
en: They thus have no existing nature of their own.

source: །སྒྱུ་མ་དང་རྨི་ལམ་དང་གཟུགས་བརྙན་ལྟ་བུའོ།
en: They are like conjurations, dreams, and reflections.”

source: །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་སེ་གོལ་གྱི་སྒྲ་དེས་ཏིང་ངེ་འཛིན་དེ་ལས་ལངས་པར་གྱུར་པ་དང་། དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་བྱམས་པས་སྨྲས་པ།
en: Then, with that finger snap, Sudhana, the head merchant’s son, arose from samādhi.

source: རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའི་བྱིན་གྱི་རླབས་རྣམ་པར་འཕྲུལ་པ་མཐོང་མོད།
en: The bodhisattva Maitreya then said to him, “Noble one, you have seen the miraculous manifestations of the blessing of a bodhisattva.

source: ཁྱོད་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའི་ཚོགས་ཀྱི་མཐུ་དང་རྒྱུ་མཐུན་པ་མཐོང་མོད།
en: You have seen the power and natural result of the accumulations of a bodhisattva.

source: ཁྱོད་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའི་སྨོན་ལམ་གྱི་ཡེ་ཤེས་ཀྱིས་རྣམ་པར་བསྒྲུབས་པ་མཐོང་མོད།
en: You have seen accomplishments through the wisdom of the prayers of a bodhisattva.

source: ཁྱོད་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའི་གནས་མདངས་དགའ་བ་མཐོང་མོད།
en: You have seen the delightful abodes of a bodhisattva.

source: ཁྱོད་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཡོངས་སུ་བསྡུ་བ་མཐོང་མོད།
en: You have seen the accumulated conduct of a bodhisattva.

source: ཁྱོད་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའི་འབྱུང་བའི་སྒོ་ཐོས་མོད།
en: You have heard the doors through which the bodhisattvas come forth.

source: ཁྱོད་ཀྱིས་སངས་རྒྱས་ཀྱི་ཞིང་གི་ཡོན་ཏན་དང་རྒྱན་ཚད་མེད་པ་མཐོང་མོད།
en: You have seen the immeasurable qualities and displays of the buddha realms.

source: ཁྱོད་ཀྱིས་དེ་བཞིན་གཤེགས་པའི་སྨོན་ལམ་རྣམ་པ་ཐ་དད་པའི་ཁྱད་པར་མཐོང་མོད།
en: You have seen the specific different prayers of the tathāgatas.

source: ཁྱོད་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་བ་བསམ་གྱིས་མི་ཁྱབ་པའི་རྗེས་སུ་འབྲང་བར་བྱས་མོད།
en: You have followed the inconceivable liberation of the bodhisattva.

source: ཁྱོད་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་གྱི་དགའ་བ་དང་བདེ་བ་མྱོང་མོད་ནོར་བཟངས་ཀྱིས་སྨྲས་པ་འཕགས་པ་དགེ་བའི་བཤེས་གཉེན་གྱི་བྱིན་གྱི་རླབས་དང་དགེ་བའི་བཤེས་གཉེན་གྱི་དགོངས་པ་དང་དགེ་བའི་བཤེས་གཉེན་གྱི་མཐུས་མཐོང་ངོ་།
en: You have experienced the delight and bliss of the bodhisattva’s samādhi.” Sudhana said, “Ārya, I have seen them through the blessing of the kalyāṇamitra, through the intention of the kalyāṇamitra, and through the power of the kalyāṇamitra.

source: །འཕགས་པ་རྣམ་པར་ཐར་པ་འདིའི་མིང་ཅི་ཞེས་བགྱི་སྨྲས་པ།
en: Ārya, what is this liberation called?”

source: རིགས་ཀྱི་བུ་རྣམ་པར་ཐར་པ་འདི་ནི་དུས་གསུམ་གྱི་དམིགས་པ་ཐམས་ཅད་ལ་ཤེས་པ་རབ་ཏུ་ཞུགས་པའི་དྲན་པ་ཉམས་པ་མེད་པས་བརྒྱན་པའི་སྙིང་པོ་ཞེས་བྱ་བ་སྟེ།
en: Maitreya answered, “Noble one, this liberation is called the essence of the display of the unfailing memory that engages with the knowledge of all objects of perception in the three times

source: རིགས་ཀྱི་བུ་རྣམ་པར་ཐར་པ་འདི་ལྟ་བུ་བརྗོད་དུ་མེད་པའི་ཡང་བརྗོད་དུ་མེད་པ་དག་ནི་ཚེ་གཅིག་གིས་ཐོགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ཐོབ་བོ། །ནོར་བཟངས་ཀྱིས་སྨྲས་པ།
en: “Noble one, this kind of liberation, which is inexpressibly inexpressible, is the attainment of a bodhisattva with one lifetime remaining.”

source: འཕགས་པ་རྒྱན་དེ་དག་གང་དུ་མཆིས།
en: Sudhana asked, “Ārya, where is this display?”

source: སྨྲས་པ་གང་ནས་འོང་བ་དེར་རོ།
en: The bodhisattva Maitreya answered, “It is where it comes from.”

source: །ནོར་བཟངས་ཀྱིས་སྨྲས་པ་གང་ནས་མཆིས་སྨྲས་པ།
en: Sudhana asked, “Where does it come from?”

source: བྱང་ཆུབ་སེམས་དཔའི་ཡེ་ཤེས་ཀྱི་བྱིན་གྱི་རླབས་མངོན་པར་བསྒྲུབས་པ་ལས་འོངས་སོ།
en: The bodhisattva Maitreya answered, “It comes from the accomplishment of the blessing of the wisdom of a bodhisattva.

source: །དེ་ནི་བྱིན་གྱི་རླབས་དེ་ཉིད་ལ་གནས་ཤིང་གང་དུ་ཡང་སོང་བ་མེད་ལ་འཕོས་པ་མེད་དོ།
en: It dwells within that blessing. It does not come or go from anywhere.

source: །ཕུང་པོར་གྱུར་པ་མེད་དོ།
en: It does not accumulate.

source: །ཚོགས་སུ་གྱུར་པ་མེད་དོ།
en: It does not come together.

source: །བརྩེགས་པར་གནས་པ་མེད་དོ།
en: It does not amass.

source: །དངོས་པོར་གནས་པ་མེད་དོ།
en: It has no location as a thing.

source: །ཡུལ་ན་གནས་པ་མ་ཡིན་ནོ།
en: It has no location as an object of perception.

source: །ཕྱོགས་ན་གནས་པ་མ་ཡིན་ནོ།
en: It has no location in any direction.

source: །རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན། ཀླུ་རྣམས་ཀྱི་སྤྲིན་གྱི་དྲ་བ་ནི་ལུས་ལ་ཡང་མི་གནས། སེམས་ལ་ཡང་མི་གནས་ནང་ལ་ཡང་མི་གནས་མོད་ཀྱི་ཀླུའི་སེམས་ཀྱི་དབང་དང་ཀླུའི་དབང་བསམ་གྱིས་མི་ཁྱབ་པས་ཆར་གྱི་རྒྱུན་ཚད་མེད་པ་བཀྱེ་བ་ནི་མེད་པ་མ་ཡིན་ཏེ་སྣང་ངོ་།
en: “By analogy, noble one, the net of clouds of the nāgas is not located in the body, is not located in the mind, is not located internally, and yet through the power of a nāga’s mind and through the inconceivable power of a nāga there is emitted a measureless flow of rain, which is not nonexistent and appears.

source: །རིགས་ཀྱི་བུ་དེ་བཞིན་དུ་རྒྱན་དེ་དག་ཀྱང་ནང་ནའང་གནས་མ་ཡིན། ཕྱི་རོལ་ན་གནས་པ་ཡང་མ་ཡིན་ཏེ། བྱང་ཆུབ་སེམས་དཔའི་བྱིན་གྱི་རླབས་ཀྱི་དབང་དང་། ཁྱོད་ཀྱི་སྣོད་བཟང་པོའི་ཕྱིར་མི་སྣང་བར་ཡང་མ་ཡིན་ནོ།
en: In the same way, noble one, those displays are not located internally and are not located externally, but they become visible through the power of a bodhisattva’s blessing and through your being a good vessel.
